Autodesk.Revit.DB.WorksetId.op_GreaterThanOrEqual(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether one WorksetId is not less than another WorksetId.
WorksetId1: The first WorksetId.
WorksetId2: The second WorksetId.
Returns: True if the first WorksetId is not less than the second WorksetId, otherwise, false.

Autodesk.Revit.DB.WorksetId.op_LessThanOrEqual(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether one WorksetId is not greater than another WorksetId.
WorksetId1: The first WorksetId.
WorksetId2: The second WorksetId.
Returns: True if the first WorksetId is not greater than the second WorksetId, otherwise, false.

Autodesk.Revit.DB.WorksetId.op_GreaterThan(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether one WorksetId is greater than another WorksetId.
WorksetId1: The first WorksetId.
WorksetId2: The second WorksetId.
Returns: True if the first WorksetId is greater than the second WorksetId, otherwise, false.

Autodesk.Revit.DB.WorksetId.op_LessThan(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether this WorksetId is less than another WorksetId.
WorksetId1: The first WorksetId.
WorksetId2: The second WorksetId.
Returns: True if the first WorksetId is less than the second WorksetId, otherwise, false.

Autodesk.Revit.DB.WorksetId.op_Inequality(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether these two WorksetIds are different.
first: The first WorksetId.
second: The second WorksetId.
Returns: True if the WorksetIds are different; otherwise, false.

Autodesk.Revit.DB.WorksetId.op_Equality(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
Determines whether these two WorksetIds are the same.
first: The first WorksetId.
second: The second WorksetId.
Returns: True if the WorksetIds are the same; otherwise, false.

Autodesk.Revit.DB.WorksetId.Compare(Autodesk.Revit.DB.WorksetId)
Compares two WorksetIds.
id: The WorksetId to be compared with this WorksetId.
Returns: -1 if this WorksetId is less than id, 0 if equal, 1 if greater.

Autodesk.Revit.DB.WorksetId.InvalidWorksetId
Get the invalid WorksetId whose IntegerValue is -1.

Autodesk.Revit.DB.WorksetId.GetHashCode
Gets the integer value of the id as hash code

Autodesk.Revit.DB.WorksetId.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.WorksetId.ToString
Gets a String representation of the integer value of the id.

Autodesk.Revit.DB.WorksetId.IntegerValue
Provides the value of the WorksetId as an integer.

Autodesk.Revit.DB.WorksetId.#ctor(System.Int32)
Create an WorksetId handle with the given integer id.
id: The id.

Autodesk.Revit.DB.WorksetId
WorksetId identifies a workset within a single document.
Remarks:
WorksetId is not guaranteed to be unique.
It is only valid within one model and its value may change when the model is synchronized with central.
If unique identification of a workset is needed, the workset's GUID should be used instead.